reportDownload/statistics.json
{
  "http://practice.cybertekschool.com/upload-10" : {
    "transaction" : "http://practice.cybertekschool.com/upload-10",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 233.0,
    "medianResTime" : 233.0,
    "minResTime" : 233.0,
    "maxResTime" : 233.0,
    "pct1ResTime" : 233.0,
    "pct2ResTime" : 233.0,
    "pct3ResTime" : 233.0,
    "throughput" : 4.291845493562231,
    "receivedKBytesPerSec" : 1067.6300965665234,
    "sentKBytesPerSec" : 2.074671405579399
  },
  "http://practice.cybertekschool.com/upload-12" : {
    "transaction" : "http://practice.cybertekschool.com/upload-12",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.0,
    "medianResTime" : 126.0,
    "minResTime" : 126.0,
    "maxResTime" : 126.0,
    "pct1ResTime" : 126.0,
    "pct2ResTime" : 126.0,
    "pct3ResTime" : 126.0,
    "throughput" : 7.936507936507936,
    "receivedKBytesPerSec" : 16.44655257936508,
    "sentKBytesPerSec" : 7.114955357142857
  },
  "http://practice.cybertekschool.com/upload-11" : {
    "transaction" : "http://practice.cybertekschool.com/upload-11",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 143.0,
    "medianResTime" : 143.0,
    "minResTime" : 143.0,
    "maxResTime" : 143.0,
    "pct1ResTime" : 143.0,
    "pct2ResTime" : 143.0,
    "pct3ResTime" : 143.0,
    "throughput" : 6.993006993006993,
    "receivedKBytesPerSec" : 88.86718750000001,
    "sentKBytesPerSec" : 6.221317744755245
  },
  "http://practice.cybertekschool.com/upload-14" : {
    "transaction" : "http://practice.cybertekschool.com/upload-14",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 133.0,
    "medianResTime" : 133.0,
    "minResTime" : 133.0,
    "maxResTime" : 133.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 133.0,
    "pct3ResTime" : 133.0,
    "throughput" : 7.518796992481203,
    "receivedKBytesPerSec" : 433.53500939849624,
    "sentKBytesPerSec" : 3.6345747180451125
  },
  "http://practice.cybertekschool.com/upload-13" : {
    "transaction" : "http://practice.cybertekschool.com/upload-13",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 156.0,
    "medianResTime" : 156.0,
    "minResTime" : 156.0,
    "maxResTime" : 156.0,
    "pct1ResTime" : 156.0,
    "pct2ResTime" : 156.0,
    "pct3ResTime" : 156.0,
    "throughput" : 6.41025641025641,
    "receivedKBytesPerSec" : 138.3651342147436,
    "sentKBytesPerSec" : 3.117487980769231
  },
  "http://practice.cybertekschool.com/upload-0" : {
    "transaction" : "http://practice.cybertekschool.com/upload-0",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 986.0,
    "medianResTime" : 986.0,
    "minResTime" : 986.0,
    "maxResTime" : 986.0,
    "pct1ResTime" : 986.0,
    "pct2ResTime" : 986.0,
    "pct3ResTime" : 986.0,
    "throughput" : 1.0141987829614605,
    "receivedKBytesPerSec" : 3.8696041455375254,
    "sentKBytesPerSec" : 530.0149356617648
  },
  "http://practice.cybertekschool.com/upload-1" : {
    "transaction" : "http://practice.cybertekschool.com/upload-1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 667.0,
    "medianResTime" : 667.0,
    "minResTime" : 667.0,
    "maxResTime" : 667.0,
    "pct1ResTime" : 667.0,
    "pct2ResTime" : 667.0,
    "pct3ResTime" : 667.0,
    "throughput" : 1.4992503748125936,
    "receivedKBytesPerSec" : 194.97136197526237,
    "sentKBytesPerSec" : 1.3264851949025487
  },
  "http://practice.cybertekschool.com/upload-15" : {
    "transaction" : "http://practice.cybertekschool.com/upload-15",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 156.0,
    "medianResTime" : 156.0,
    "minResTime" : 156.0,
    "maxResTime" : 156.0,
    "pct1ResTime" : 156.0,
    "pct2ResTime" : 156.0,
    "pct3ResTime" : 156.0,
    "throughput" : 6.41025641025641,
    "receivedKBytesPerSec" : 80.19080528846153,
    "sentKBytesPerSec" : 3.2739883814102564
  },
  "http://practice.cybertekschool.com/upload-2" : {
    "transaction" : "http://practice.cybertekschool.com/upload-2",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 906.0,
    "medianResTime" : 906.0,
    "minResTime" : 906.0,
    "maxResTime" : 906.0,
    "pct1ResTime" : 906.0,
    "pct2ResTime" : 906.0,
    "pct3ResTime" : 906.0,
    "throughput" : 1.1037527593818985,
    "receivedKBytesPerSec" : 381.6915011037527,
    "sentKBytesPerSec" : 0.9647057809050772
  },
  "http://practice.cybertekschool.com/upload-3" : {
    "transaction" : "http://practice.cybertekschool.com/upload-3",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 277.0,
    "medianResTime" : 277.0,
    "minResTime" : 277.0,
    "maxResTime" : 277.0,
    "pct1ResTime" : 277.0,
    "pct2ResTime" : 277.0,
    "pct3ResTime" : 277.0,
    "throughput" : 3.6101083032490977,
    "receivedKBytesPerSec" : 103.87522563176894,
    "sentKBytesPerSec" : 3.1870487364620934
  },
  "http://practice.cybertekschool.com/upload-4" : {
    "transaction" : "http://practice.cybertekschool.com/upload-4",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 277.0,
    "medianResTime" : 277.0,
    "minResTime" : 277.0,
    "maxResTime" : 277.0,
    "pct1ResTime" : 277.0,
    "pct2ResTime" : 277.0,
    "pct3ResTime" : 277.0,
    "throughput" : 3.6101083032490977,
    "receivedKBytesPerSec" : 4.428023465703971,
    "sentKBytesPerSec" : 3.1870487364620934
  },
  "http://practice.cybertekschool.com/upload-5" : {
    "transaction" : "http://practice.cybertekschool.com/upload-5",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 445.0,
    "medianResTime" : 445.0,
    "minResTime" : 445.0,
    "maxResTime" : 445.0,
    "pct1ResTime" : 445.0,
    "pct2ResTime" : 445.0,
    "pct3ResTime" : 445.0,
    "throughput" : 2.247191011235955,
    "receivedKBytesPerSec" : 1.896067415730337,
    "sentKBytesPerSec" : 1.0489817415730336
  },
  "http://practice.cybertekschool.com/upload-6" : {
    "transaction" : "http://practice.cybertekschool.com/upload-6",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 465.0,
    "medianResTime" : 465.0,
    "minResTime" : 465.0,
    "maxResTime" : 465.0,
    "pct1ResTime" : 465.0,
    "pct2ResTime" : 465.0,
    "pct3ResTime" : 465.0,
    "throughput" : 2.150537634408602,
    "receivedKBytesPerSec" : 329.133064516129,
    "sentKBytesPerSec" : 1.0437668010752688
  },
  "http://practice.cybertekschool.com/upload-7" : {
    "transaction" : "http://practice.cybertekschool.com/upload-7",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 186.0,
    "medianResTime" : 186.0,
    "minResTime" : 186.0,
    "maxResTime" : 186.0,
    "pct1ResTime" : 186.0,
    "pct2ResTime" : 186.0,
    "pct3ResTime" : 186.0,
    "throughput" : 5.376344086021506,
    "receivedKBytesPerSec" : 190.15667002688173,
    "sentKBytesPerSec" : 2.5201612903225805
  },
  "http://practice.cybertekschool.com/upload-8" : {
    "transaction" : "http://practice.cybertekschool.com/upload-8",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 242.0,
    "medianResTime" : 242.0,
    "minResTime" : 242.0,
    "maxResTime" : 242.0,
    "pct1ResTime" : 242.0,
    "pct2ResTime" : 242.0,
    "pct3ResTime" : 242.0,
    "throughput" : 4.132231404958678,
    "receivedKBytesPerSec" : 359.97223657024796,
    "sentKBytesPerSec" : 1.973301911157025
  },
  "http://practice.cybertekschool.com/upload-9" : {
    "transaction" : "http://practice.cybertekschool.com/upload-9",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 180.0,
    "medianResTime" : 180.0,
    "minResTime" : 180.0,
    "maxResTime" : 180.0,
    "pct1ResTime" : 180.0,
    "pct2ResTime" : 180.0,
    "pct3ResTime" : 180.0,
    "throughput" : 5.555555555555555,
    "receivedKBytesPerSec" : 203.93337673611111,
    "sentKBytesPerSec" : 2.7669270833333335
  },
  "http://practice.cybertekschool.com/upload" : {
    "transaction" : "http://practice.cybertekschool.com/upload",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1955.0,
    "medianResTime" : 1955.0,
    "minResTime" : 1955.0,
    "maxResTime" : 1955.0,
    "pct1ResTime" : 1955.0,
    "pct2ResTime" : 1955.0,
    "pct3ResTime" : 1955.0,
    "throughput" : 0.5115089514066495,
    "receivedKBytesPerSec" : 602.5820212595908,
    "sentKBytesPerSec" : 272.25863171355496
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 443.11764705882365,
    "medianResTime" : 242.0,
    "minResTime" : 126.0,
    "maxResTime" : 1955.0,
    "pct1ResTime" : 1179.7999999999993,
    "pct2ResTime" : 1955.0,
    "pct3ResTime" : 1955.0,
    "throughput" : 8.695652173913043,
    "receivedKBytesPerSec" : 1205.1640425191815,
    "sentKBytesPerSec" : 544.5172634271099
  }
}